app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def index
    user_id = params[:user_id]

    if user_id.blank?
      @posts = Post.all
    else
      user = User.find(user_id)